run/BM3/BM3_ConvAndRad/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0]; // kg m s K mol A cd

press   0; 

internalField   uniform  $press; 

boundaryField
{


    lowerWall
    {
        type            fixedFluxPressure;
        value           uniform $press;
    }

    inletWall
    {
		type            fixedFluxPressure;
        value           uniform 0;
	}
	
    atmosphere
    {
        type            totalPressure;
        p0              uniform $press;
    } 


    defaultFaces
    {
        type            empty;
    }
}

// ************************************************************************* //
